{
  "irVersion": "1.0",
  "project": "structured-changelog",
  "repository": "https://github.com/grokify/structured-changelog",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.10.0",
      "date": "2026-02-08",
      "highlights": [
        { "description": "Localization support for rendered Markdown output in 6 languages" },
        { "description": "Header text fully localized including versioning and convention references" },
        { "description": "JSON schema migrated to camelCase for ecosystem consistency" }
      ],
      "breaking": [
        { "description": "All JSON property names changed from snake_case to camelCase (e.g., `irVersion` instead of `ir_version`)", "commit": "adc355c" }
      ],
      "upgradeGuide": [
        { "description": "Update existing CHANGELOG.json files to use camelCase property names", "commit": "adc355c" },
        { "description": "Re-run `schangelog validate` to check for any issues", "commit": "adc355c" }
      ],
      "added": [
        { "description": "`--locale` flag for `generate` command to output in different languages", "commit": "64edc2e" },
        { "description": "`--locale-file` flag for custom translation overrides", "commit": "64edc2e" },
        { "description": "Built-in translations for 6 locales: English, German, Spanish, French, Japanese, Chinese", "commit": "64edc2e" },
        { "description": "`Locale` and `LocaleOverrides` renderer options", "commit": "64edc2e" },
        { "description": "Header text localization for Keep a Changelog, versioning, and generator references", "commit": "19b3f06" }
      ],
      "dependencies": [
        { "description": "Add `github.com/grokify/structured-locale` v0.1.0 for localization support", "commit": "64edc2e" }
      ],
      "tests": [
        { "description": "Add localization unit tests for message loading and translation", "commit": "c56fe84" }
      ]
    },
    {
      "version": "v0.9.0",
      "date": "2026-02-02",
      "highlights": [
        { "description": "New CLI commands for changelog backfilling: `list-tags`, `init --from-tags`, and `parse-commits --all-versions`" }
      ],
      "added": [
        { "description": "`list-tags` command to list semver tags with dates and commit counts between versions", "commit": "e0ff0e0" },
        { "description": "`init --from-tags` command to generate skeleton CHANGELOG.json from git tag history", "commit": "e0ff0e0" },
        { "description": "`--all-versions` flag for `parse-commits` to parse all version ranges at once for backfilling", "commit": "c293a4d" },
        { "description": "`parse-commits --until` without `--since` to parse from first commit to specified ref", "commit": "c293a4d" },
        { "description": "`gitlog.GetTags()` function returning semver tags sorted by version with dates and commit counts", "commit": "460bc6f" },
        { "description": "`gitlog.GetAllVersionRanges()` function for retrieving version ranges for parsing", "commit": "460bc6f" },
        { "description": "`gitlog.GetFirstCommit()` function to get the initial commit hash", "commit": "460bc6f" }
      ],
      "documentation": [
        { "description": "Moved MkDocs source from `docsrc/` to `docs/`, HTML now published to `gh-pages` branch", "commit": "9df3505" }
      ]
    },
    {
      "version": "v0.8.0",
      "date": "2026-01-18",
      "highlights": [
        { "description": "Monorepo tag path support for repositories using path-prefixed version tags (e.g., `sdk/go/v1.0.0`)" }
      ],
      "added": [
        { "description": "`tagPath` field in changelog IR for specifying version tag prefixes in monorepos", "commit": "7761ead" },
        { "description": "Automatic path prefixing for compare and tag links when `tagPath` is set", "commit": "7761ead" },
        { "description": "`tagPath` property in JSON schema with documentation", "commit": "7761ead" }
      ],
      "tests": [
        { "description": "Comprehensive tests for tag path functionality including GitHub, GitLab, unreleased links, and edge cases", "commit": "25a3190" }
      ]
    },
    {
      "version": "v0.7.0",
      "date": "2026-01-11",
      "highlights": [
        { "description": "CLI renamed from `sclog` to `schangelog` for naming consistency with sibling tools (sroadmap, sprd, strd)" }
      ],
      "changed": [
        { "description": "CLI binary renamed from `sclog` to `schangelog` for consistency with sibling structured document tools", "breaking": true, "commit": "e58d452" }
      ],
      "documentation": [
        { "description": "Updated all documentation, examples, and help text to use `schangelog`", "commit": "e58d452" },
        { "description": "Added git log alternatives section to project CLAUDE.md recommending `schangelog` over raw git commands", "commit": "e58d452" }
      ]
    },
    {
      "version": "v0.6.0",
      "date": "2026-01-10",
      "highlights": [
        { "description": "TOON output format for LLM commands (~8x token reduction vs raw git log)" },
        { "description": "GitLab repository support with automatic reference linking for issues, PRs, and commits" },
        { "description": "Author attribution for external contributors and compact grouping of maintenance releases" }
      ],
      "added": [
        { "description": "TOON (Token-Oriented Object Notation) as default output format for `parse-commits`, `suggest-category`, and `validate --format`", "commit": "2be0cc0" },
        { "description": "`--format` flag for LLM commands supporting `toon` (default), `json`, and `json-compact`", "commit": "2be0cc0" },
        { "description": "GitLab repository support for reference links and version comparisons", "commit": "be9b3b0" },
        { "description": "Automatic reference linking: issues, PRs, and commits become clickable links when repository URL is provided", "commit": "be9b3b0" },
        { "description": "`LinkReferences` renderer option (now enabled by default) for hyperlinking references", "commit": "be9b3b0" },
        { "description": "`IncludeUnreleasedLink` renderer option (enabled by default) for always showing compare link to HEAD", "commit": "d4b3e90" },
        { "description": "`versioning` field in changelog IR: `semver`, `calver`, `custom`, or `none`", "commit": "93b8da1" },
        { "description": "`commitConvention` field in changelog IR: `conventional` or `none`", "commit": "93b8da1" },
        { "description": "Dynamic header generation based on versioning scheme and commit convention", "commit": "be9b3b0" },
        { "description": "Validation error codes E008 (invalid versioning) and E009 (invalid commit convention)", "commit": "93b8da1" },
        { "description": "`maintainers` and `bots` fields in changelog IR for identifying team members", "commit": "91e788f" },
        { "description": "Auto-detection of common bots (dependabot, renovate, github-actions, etc.)", "commit": "91e788f" },
        { "description": "`IsTeamMember()` method for checking if author is maintainer or bot", "commit": "91e788f" },
        { "description": "`IncludeAuthors` renderer option for external contributor attribution", "commit": "a2c86cb" },
        { "description": "Automatic author attribution with linked GitHub/GitLab profiles", "commit": "a2c86cb" },
        { "description": "Inline attribution stripping to avoid duplicate attribution when author field matches", "commit": "b5e8f34" },
        { "description": "`CompactMaintenanceReleases` renderer option for grouping maintenance-only releases", "commit": "f7cdb02" },
        { "description": "`IsMaintenanceOnly()` method to detect dependency/documentation-only releases", "commit": "824a075" },
        { "description": "`--changelog` flag for `parse-commits` to auto-detect external contributors", "commit": "817fa7f" },
        { "description": "`IsExternal` field in commit output marking external contributors", "commit": "8e1ab0a" },
        { "description": "`Contributors` summary in `parse-commits` output with deduplicated author list", "commit": "8e1ab0a" },
        { "description": "`IsTeamMemberByNameAndEmail()` for matching by git author name, email, or GitHub noreply username", "commit": "5169681" }
      ],
      "changed": [
        { "description": "LLM commands now output TOON format by default for ~40% token reduction vs JSON", "breaking": true, "commit": "2be0cc0" },
        { "description": "`parse-commits` and `suggest-category`: `--compact` flag replaced with `--format` flag", "breaking": true, "commit": "2be0cc0" },
        { "description": "`validate`: `--json` flag replaced with `--format` flag", "breaking": true, "commit": "2be0cc0" },
        { "description": "Commit references displayed as short hash (7 chars) with backticks in linked output", "commit": "be9b3b0" },
        { "description": "Consecutive maintenance releases grouped into compact sections by default", "commit": "f7cdb02" },
        { "description": "Version strings now used as-is in headers and links (no automatic `v` prefix)", "commit": "9e17c24" }
      ],
      "documentation": [
        { "description": "TOON integration design document", "commit": "f5850bf" },
        { "description": "Updated LLM guide with TOON examples and ~8x token efficiency", "commit": "f5850bf" },
        { "description": "Reference linking documentation in specification", "commit": "f5850bf" },
        { "description": "Claude Code project configuration with `/changelog` slash command", "commit": "8d4cf61" }
      ]
    },
    {
      "version": "v0.5.0",
      "date": "2026-01-04",
      "highlights": [
        { "description": "LLM-assisted changelog generation with optimized git parsing (~5x token reduction) and automatic commit classification" }
      ],
      "added": [
        { "description": "`parse-commits` command for LLM-optimized git history output (~5x token reduction vs raw git log)", "commit": "4503119" },
        { "description": "`suggest-category` command for commit classification with confidence levels", "commit": "1432b6e" },
        { "description": "`--json` flag for `validate` command with structured error output, line numbers, and fix suggestions", "commit": "1c705e9" },
        { "description": "MkDocs documentation site with Material theme", "commit": "c8b280d" },
        { "description": "LLM integration guide with prompts and workflows", "commit": "178f6a0" },
        { "description": "PRD documents for planned localization and rendering features", "commit": "20c1f7f" }
      ],
      "documentation": [
        { "description": "Release notes consolidated in `docsrc/releases/` for MkDocs site", "commit": "cac7f70" }
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2026-01-04",
      "highlights": [
        { "description": "Extend Keep a Changelog with 13 additional change types organized into tiers for flexible filtering and validation" }
      ],
      "added": [
        { "description": "Tier-based change type system with 4 levels: **core** (KACL standard), **standard** (common extensions), **extended** (docs/build/acknowledgments), **optional** (operations/internal)", "commit": "b185758" },
        { "description": "19 change types in canonical order (see `CHANGE_TYPES.json`)", "commit": "b185758" },
        { "description": "New change types beyond Keep a Changelog: Highlights, Breaking, Upgrade Guide, Performance, Dependencies, Documentation, Build, Infrastructure, Observability, Compliance, Internal, Known Issues, Contributors", "commit": "b185758" },
        { "description": "CLI flags: `--max-tier` for generate, `--min-tier` for validate", "commit": "b185758" },
        { "description": "Library functions: `Summary()`, `ValidateMinTier()`, `ParseTier()`, `OptionsFromConfig()`", "commit": "b185758" },
        { "description": "Canonical ordering documentation in README.md", "commit": "fd7312c" }
      ],
      "changed": [
        { "description": "Change types now support tier-based filtering for validation and generation", "commit": "b185758" },
        { "description": "CLI refactored to use library functions for better testability", "commit": "b185758" }
      ],
      "tests": [
        { "description": "Comprehensive unit tests achieving 98%+ library coverage (changelog: 98.2%, renderer: 98.9%)", "commit": "da9559e" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-01-04",
      "highlights": [
        { "description": "Install via Homebrew or download pre-built binaries for Linux, macOS, and Windows - no Go toolchain required" }
      ],
      "added": [
        { "description": "GoReleaser configuration for multi-platform binary releases (Linux, macOS, Windows × amd64, arm64)", "commit": "5f2adeb" },
        { "description": "GitHub Actions release workflow triggered by version tags", "commit": "5f2adeb" },
        { "description": "Homebrew tap distribution via `brew install structured-changelog`", "commit": "5f2adeb" },
        { "description": "Binary symlink: both `sclog` and `structured-changelog` commands available", "commit": "5f2adeb" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-01-03",
      "highlights": [
        { "description": "Generated changelogs now include clickable version comparison links for easy navigation on GitHub" }
      ],
      "added": [
        { "description": "GitHub version reference links at bottom of rendered Markdown", "commit": "b810bf0" },
        { "description": "Auto-detect GitHub repository from `repository` field", "commit": "b810bf0" },
        { "description": "First release links to `/releases/tag/vX.Y.Z`", "commit": "b810bf0" },
        { "description": "Subsequent releases link to `/compare/vA...vB`", "commit": "b810bf0" },
        { "description": "Unreleased section links to `/compare/vLatest...HEAD`", "commit": "b810bf0" },
        { "description": "Dependabot configuration for Go modules and GitHub Actions", "commit": "36ee0c5" }
      ],
      "changed": [
        { "description": "Add Structured Changelog attribution to rendered Markdown header", "commit": "7c18e7b" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-03",
      "highlights": [
        { "description": "Machine-readable JSON changelog with deterministic Markdown generation following Keep a Changelog format" }
      ],
      "added": [
        { "description": "JSON IR schema for structured changelogs (v1.0)", "commit": "0ba99fc" },
        { "description": "`changelog` package with IR types, parsing, and validation", "commit": "0ba99fc" },
        { "description": "`renderer` package with deterministic Markdown generation", "commit": "0ba99fc" },
        { "description": "`sclog` CLI with `validate` and `generate` subcommands", "commit": "0ba99fc" },
        { "description": "Support for Keep a Changelog categories: added, changed, deprecated, removed, fixed, security", "commit": "0ba99fc" },
        { "description": "Optional security metadata: CVE, GHSA, severity, CVSS, CWE", "commit": "0ba99fc" },
        { "description": "Optional SBOM metadata: component, version, license", "commit": "0ba99fc" },
        { "description": "JSON Schema for IR validation", "commit": "0ba99fc" },
        { "description": "Example changelogs: basic, security, full", "commit": "0ba99fc" },
        { "description": "Documentation: spec, security guide, SBOM guide", "commit": "0ba99fc" }
      ]
    }
  ]
}
