{
  "ir_version": "1.0",
  "project": "structured-changelog",
  "repository": "https://github.com/grokify/structured-changelog",
  "releases": [
    {
      "version": "0.4.0",
      "date": "2026-01-04",
      "added": [
        { "description": "Tier-based change type system with 4 levels: **core** (KACL standard), **standard** (common extensions), **extended** (docs/build/acknowledgments), **optional** (operations/internal)" },
        { "description": "19 change types in canonical order (see `CHANGE_TYPES.json`)" },
        { "description": "New change types beyond Keep a Changelog: Highlights, Breaking, Upgrade Guide, Performance, Dependencies, Documentation, Build, Infrastructure, Observability, Compliance, Internal, Known Issues, Contributors" },
        { "description": "CLI flags: `--max-tier` for generate, `--min-tier` for validate" },
        { "description": "Library functions: `Summary()`, `ValidateMinTier()`, `ParseTier()`, `OptionsFromConfig()`" },
        { "description": "Canonical ordering documentation in README.md" }
      ],
      "changed": [
        { "description": "Change types now support tier-based filtering for validation and generation" },
        { "description": "CLI refactored to use library functions for better testability" }
      ],
      "tests": [
        { "description": "Comprehensive unit tests achieving 98%+ library coverage (changelog: 98.2%, renderer: 98.9%)" }
      ]
    },
    {
      "version": "0.3.0",
      "date": "2026-01-04",
      "added": [
        { "description": "GoReleaser configuration for multi-platform binary releases (Linux, macOS, Windows × amd64, arm64)" },
        { "description": "GitHub Actions release workflow triggered by version tags" },
        { "description": "Homebrew tap distribution via `brew install structured-changelog`" },
        { "description": "Binary symlink: both `sclog` and `structured-changelog` commands available" }
      ]
    },
    {
      "version": "0.2.0",
      "date": "2026-01-03",
      "added": [
        { "description": "GitHub version reference links at bottom of rendered Markdown" },
        { "description": "Auto-detect GitHub repository from `repository` field" },
        { "description": "First release links to `/releases/tag/vX.Y.Z`" },
        { "description": "Subsequent releases link to `/compare/vA...vB`" },
        { "description": "Unreleased section links to `/compare/vLatest...HEAD`" },
        { "description": "Dependabot configuration for Go modules and GitHub Actions" }
      ],
      "changed": [
        { "description": "Add Structured Changelog attribution to rendered Markdown header" }
      ]
    },
    {
      "version": "0.1.0",
      "date": "2026-01-03",
      "added": [
        { "description": "JSON IR schema for structured changelogs (v1.0)" },
        { "description": "`changelog` package with IR types, parsing, and validation" },
        { "description": "`renderer` package with deterministic Markdown generation" },
        { "description": "`sclog` CLI with `validate` and `generate` subcommands" },
        { "description": "Support for Keep a Changelog categories: added, changed, deprecated, removed, fixed, security" },
        { "description": "Optional security metadata: CVE, GHSA, severity, CVSS, CWE" },
        { "description": "Optional SBOM metadata: component, version, license" },
        { "description": "JSON Schema for IR validation" },
        { "description": "Example changelogs: basic, security, full" },
        { "description": "Documentation: spec, security guide, SBOM guide" }
      ]
    }
  ]
}
