{
  "ir_version": "1.0",
  "project": "structured-changelog",
  "repository": "https://github.com/grokify/structured-changelog",
  "versioning": "semver",
  "commit_convention": "conventional",
  "releases": [
    {
      "version": "0.6.0",
      "date": "2026-01-10",
      "highlights": [
        { "description": "TOON output format for LLM commands (~8x token reduction vs raw git log), GitLab repository support, and automatic reference linking" }
      ],
      "added": [
        { "description": "TOON (Token-Oriented Object Notation) as default output format for `parse-commits`, `suggest-category`, and `validate --format`" },
        { "description": "`--format` flag for LLM commands supporting `toon` (default), `json`, and `json-compact`" },
        { "description": "GitLab repository support for reference links and version comparisons" },
        { "description": "Automatic reference linking: issues, PRs, and commits become clickable links when repository URL is provided" },
        { "description": "`LinkReferences` renderer option (enabled in `FullOptions`) for hyperlinking references" },
        { "description": "`versioning` field in changelog IR: `semver`, `calver`, `custom`, or `none`" },
        { "description": "`commit_convention` field in changelog IR: `conventional` or `none`" },
        { "description": "Dynamic header generation based on versioning scheme and commit convention" },
        { "description": "Validation error codes E008 (invalid versioning) and E009 (invalid commit convention)" }
      ],
      "changed": [
        { "description": "LLM commands now output TOON format by default for ~40% token reduction vs JSON", "breaking": true },
        { "description": "`parse-commits` and `suggest-category`: `--compact` flag replaced with `--format` flag", "breaking": true },
        { "description": "`validate`: `--json` flag replaced with `--format` flag", "breaking": true },
        { "description": "Commit references displayed as short hash (7 chars) with backticks in linked output" }
      ],
      "documentation": [
        { "description": "TOON integration design document" },
        { "description": "Updated LLM guide with TOON examples and ~8x token efficiency" },
        { "description": "Reference linking documentation in specification" },
        { "description": "Claude Code project configuration with `/changelog` slash command" }
      ]
    },
    {
      "version": "0.5.0",
      "date": "2026-01-04",
      "highlights": [
        { "description": "LLM-assisted changelog generation with optimized git parsing (~5x token reduction) and automatic commit classification" }
      ],
      "added": [
        { "description": "`parse-commits` command for LLM-optimized git history output (~5x token reduction vs raw git log)" },
        { "description": "`suggest-category` command for commit classification with confidence levels" },
        { "description": "`--json` flag for `validate` command with structured error output, line numbers, and fix suggestions" },
        { "description": "MkDocs documentation site with Material theme" },
        { "description": "LLM integration guide with prompts and workflows" },
        { "description": "PRD documents for planned localization and rendering features" }
      ],
      "documentation": [
        { "description": "Release notes consolidated in `docsrc/releases/` for MkDocs site" }
      ]
    },
    {
      "version": "0.4.0",
      "date": "2026-01-04",
      "highlights": [
        { "description": "Extend Keep a Changelog with 13 additional change types organized into tiers for flexible filtering and validation" }
      ],
      "added": [
        { "description": "Tier-based change type system with 4 levels: **core** (KACL standard), **standard** (common extensions), **extended** (docs/build/acknowledgments), **optional** (operations/internal)" },
        { "description": "19 change types in canonical order (see `CHANGE_TYPES.json`)" },
        { "description": "New change types beyond Keep a Changelog: Highlights, Breaking, Upgrade Guide, Performance, Dependencies, Documentation, Build, Infrastructure, Observability, Compliance, Internal, Known Issues, Contributors" },
        { "description": "CLI flags: `--max-tier` for generate, `--min-tier` for validate" },
        { "description": "Library functions: `Summary()`, `ValidateMinTier()`, `ParseTier()`, `OptionsFromConfig()`" },
        { "description": "Canonical ordering documentation in README.md" }
      ],
      "changed": [
        { "description": "Change types now support tier-based filtering for validation and generation" },
        { "description": "CLI refactored to use library functions for better testability" }
      ],
      "tests": [
        { "description": "Comprehensive unit tests achieving 98%+ library coverage (changelog: 98.2%, renderer: 98.9%)" }
      ]
    },
    {
      "version": "0.3.0",
      "date": "2026-01-04",
      "highlights": [
        { "description": "Install via Homebrew or download pre-built binaries for Linux, macOS, and Windows - no Go toolchain required" }
      ],
      "added": [
        { "description": "GoReleaser configuration for multi-platform binary releases (Linux, macOS, Windows × amd64, arm64)" },
        { "description": "GitHub Actions release workflow triggered by version tags" },
        { "description": "Homebrew tap distribution via `brew install structured-changelog`" },
        { "description": "Binary symlink: both `sclog` and `structured-changelog` commands available" }
      ]
    },
    {
      "version": "0.2.0",
      "date": "2026-01-03",
      "highlights": [
        { "description": "Generated changelogs now include clickable version comparison links for easy navigation on GitHub" }
      ],
      "added": [
        { "description": "GitHub version reference links at bottom of rendered Markdown" },
        { "description": "Auto-detect GitHub repository from `repository` field" },
        { "description": "First release links to `/releases/tag/vX.Y.Z`" },
        { "description": "Subsequent releases link to `/compare/vA...vB`" },
        { "description": "Unreleased section links to `/compare/vLatest...HEAD`" },
        { "description": "Dependabot configuration for Go modules and GitHub Actions" }
      ],
      "changed": [
        { "description": "Add Structured Changelog attribution to rendered Markdown header" }
      ]
    },
    {
      "version": "0.1.0",
      "date": "2026-01-03",
      "highlights": [
        { "description": "Machine-readable JSON changelog with deterministic Markdown generation following Keep a Changelog format" }
      ],
      "added": [
        { "description": "JSON IR schema for structured changelogs (v1.0)" },
        { "description": "`changelog` package with IR types, parsing, and validation" },
        { "description": "`renderer` package with deterministic Markdown generation" },
        { "description": "`sclog` CLI with `validate` and `generate` subcommands" },
        { "description": "Support for Keep a Changelog categories: added, changed, deprecated, removed, fixed, security" },
        { "description": "Optional security metadata: CVE, GHSA, severity, CVSS, CWE" },
        { "description": "Optional SBOM metadata: component, version, license" },
        { "description": "JSON Schema for IR validation" },
        { "description": "Example changelogs: basic, security, full" },
        { "description": "Documentation: spec, security guide, SBOM guide" }
      ]
    }
  ]
}
